ht32-holtek/HT32_STD_L5xxxx_FWLib/library/HT32L5xxxx_Driver/src/ht32l5xxxx_tm.c
/*********************************************************************************************************//**
 * @brief Configure prescaler of the TMx.
 * @param TMx: where TMx is the selected TM from the TM peripherals.
 * @param Psc: Specify the prescaler value.
 * @param PscReloadTime: Specify the TM prescaler reload time.
 *        This parameter can be one of the following values:
 *        @arg TM_PSC_RLD_UPDATE    : The prescaler is loaded at the next update event.
 *        @arg TM_PSC_RLD_IMMEDIATE : The prescaler is loaded immediatly.
 * @retval None
 ************************************************************************************************************/
void TM_PrescalerConfig(HT_TM_TypeDef* TMx, u16 Psc, TM_PSC_RLD_Enum PscReloadTime)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_TM(TMx));
  Assert_Param(IS_TM_PSC_RLD(PscReloadTime));

  /* Set the prescaler value                                                                                */
  TMx->PSCR = Psc;

  /* Set the UEVG bit or not                                                                                */
  TMx->EVGR = PscReloadTime;
}

/*********************************************************************************************************//**
 * @brief Configure counter mode of the TMx.
 * @param TMx: where TMx is the selected TM from the TM peripherals.
 * @param Mod: Specify the counter mode to be used.
 *        This parameter can be one of the following values:
 *        @arg TM_CNT_MODE_UP   : TM up counting mode.
 *        @arg TM_CNT_MODE_DOWN : TM down counting mode.
 *        @arg TM_CNT_MODE_CA1  : TM center aligned mode 1.
 *        @arg TM_CNT_MODE_CA2  : TM center aligned mode 2.
 *        @arg TM_CNT_MODE_CA3  : TM center aligned mode 3.
 * @retval None
 ************************************************************************************************************/
void TM_CounterModeConfig(HT_TM_TypeDef* TMx, TM_CNT_MODE_Enum Mod)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_TM(TMx));
  Assert_Param(IS_TM_CNT_MODE(Mod));

  /* Reset the CMSEL and DIR Bits                                                                           */
  TMx->CNTCFR &= CNTCFR_CMSEL_MASK;        /* CNTCFR_DIR is read only when the timer configured as          */
  TMx->CNTCFR &= ~(u32)CNTCFR_DIR;         /* Center-aligned mode. Reset mode first and then reset the      */
                                           /* CNTCFR_DIR bit (separate as two steps).                       */

  /* Set the Counter Mode                                                                                   */
  TMx->CNTCFR |= Mod;
}

/*********************************************************************************************************//**
 * @brief Select the STI source.
 * @param TMx: where TMx is the selected TM from the TM peripherals.
 * @param Sel: Specify the STI source.
 *        This parameter can be one of the following:
 *        @arg TM_TRSEL_ITI0  : Internal trigger 0.
 *        @arg TM_TRSEL_ITI1  : Internal trigger 1.
 *        @arg TM_TRSEL_ITI2  : Internal trigger 2.
 *        @arg TM_TRSEL_TI0BED : TI0 both edge detector.
 *        @arg TM_TRSEL_TI0S0 : Filtered channel 0 input.
 *        @arg TM_TRSEL_TI1S1 : Filtered channel 1 input.
 *        @arg TM_TRSEL_ETIF  : External trigger input.
 *        @arg TM_TRSEL_UEVG  : Trigger by setting UEVG bit.
 * @retval None
 ************************************************************************************************************/
void TM_StiConfig(HT_TM_TypeDef* TMx, TM_TRSEL_Enum Sel)
{
  u32 wTrcfr;

  /* Check the parameters                                                                                   */
  Assert_Param(IS_TM(TMx));
  Assert_Param(IS_TM_TRSEL(Sel));

  /* Disable slave mode                                                                                     */
  TMx->MDCFR &= MDCFR_SMSEL_MASK;

  /* Get the TRCFR value with cleared TRSEL                                                                 */
  wTrcfr = TMx->TRCFR & TRCFR_TRSEL_MASK;

  /* Set the STI source                                                                                     */
  TMx->TRCFR |= wTrcfr | Sel;
}

/*********************************************************************************************************//**
 * @brief Configure encoder interface of the TMx.
 * @param TMx: where TMx is the selected TM from the TM peripherals.
 * @param DecoderMod: Specify the TMx decoder mode.
 *        This parameter can be one of the following values:
 *        @arg TM_SMSEL_DECODER1 : Counter counts on CH0 edge depending on CH1 level.
 *        @arg TM_SMSEL_DECODER2 : Counter counts on CH1 edge depending on CH0 level.
 *        @arg TM_SMSEL_DECODER3 : Counter counts on both CH0 and CH1 edges depending on
 *             the level of the other input.
 * @param CH0P: Specify the CH0 polarity.
 *        This parameter can be one of the following values:
 *        @arg TM_CHP_NONINVERTED : Active high level or rising edge
 *        @arg TM_CHP_INVERTED    : Active low level or falling edge
 * @param CH1P: Specify the CH1 polarity.
 *        This parameter can be one of the following values:
 *        @arg TM_CHP_NONINVERTED : Active high level or rising edge
 *        @arg TM_CHP_INVERTED    : Active low level or falling edge
 * @retval None
 ************************************************************************************************************/
void TM_DecoderConfig(HT_TM_TypeDef* TMx, TM_SMSEL_Enum DecoderMod, TM_CHP_Enum CH0P, TM_CHP_Enum CH1P)
{
  u32 wMdcfr, wCh0Icfr, wCh1Icfr, wChpolr;

  /* Check the parameters                                                                                   */
  Assert_Param(IS_TM(TMx));
  Assert_Param(IS_TM_SMSEL_DECODER(DecoderMod));
  Assert_Param(IS_TM_CHP(CH0P));
  Assert_Param(IS_TM_CHP(CH1P));

  /* Get the TMx MDCFR register value                                                                       */
  wMdcfr = TMx->MDCFR;

